<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"470faafc84addf55b5722dd060dbe47a82cf43adfcbf57e521f91d0eb64a693f","plan_job_ref":"Job Plan Terraform #15 at https://github.com/Decatur-Robotics/Gearbox-Terraform/actions/runs/13189069153","plan_out_hash":"83219b695f1abf4b04b5ef65b59856416581e4083a497a0ad266243c8e54f6b3","plan_hash":"fb93b468df0f1bc732466d21e7fed268b1238b9d5906c3ca2951fade13cc5f1f","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __.__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.status-cname will be updated in-place
!~  resource "cloudflare_dns_record" "status-cname" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "gearbox-980962066.us-east-1.elb.amazonaws.com" -> "app.pulsetic.com"
!~      created_on          = "2025-02-03T22:20:13Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "8414401feaf9313a5eea18d32c031a8e"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-02-03T22:20:13Z" -> (known after apply)
        name                = "status"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform #15](https://github.com/Decatur-Robotics/Gearbox-Terraform/actions/runs/13189069153)